# CannotToggleDimensionEquality Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..CannotToggleDimensionEquality Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Toggling the dimension's equality constraint would overconstrain the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotToggleDimensionEquality { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotToggleDimensionEquality As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotToggleDimensionEquality {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace